<template>
  <div class="center-box">
    <a class="bookmark" @click="markTheChapter"><svg t="1684825313597" class="icon" viewBox="0 0 1024 1024" version="1.1"
        xmlns="http://www.w3.org/2000/svg" p-id="7433" width="48" height="48">
        <path
          d="M832 64v960L530.3 812.8c-11-7.7-25.7-7.7-36.7 0L192 1024V64c0-35.4 28.7-64 64-64h512c35.3 0 64 28.6 64 64z"
          p-id="7434" :fill="chapterInfo.marked ? '#FFD70077' : '#d8d8d8d1'"></path>
      </svg></a>
    <div class="text">
      <h1 class="chapter-title">
        {{ chapterInfo.chapterTitle }}
      </h1>
      <div class="info">
        <div class="book-name float"><svg t="1684560199171" class="icon" viewBox="0 0 1024 1024" version="1.1"
            xmlns="http://www.w3.org/2000/svg" p-id="2519">
            <path
              d="M947.701961 623.435294l-694.713725 0q-11.043137 0-23.090196 6.023529t-22.588235 18.070588-17.066667 28.611765-6.52549 37.647059 5.521569 39.152941 14.556863 32.12549 22.086275 22.086275 28.109804 8.031373l693.709804 0q-12.047059-12.047059-21.082353-27.105882-8.031373-13.05098-14.556863-31.121569t-6.52549-41.160784q0-26.101961 6.52549-43.168627t14.556863-28.109804q9.035294-12.047059 21.082353-21.082353zM947.701961 897.505882q0 17.066667-22.086275 17.066667l-733.866667 0q-34.133333 0-57.223529-14.054902t-37.647059-38.65098-20.580392-58.729412-6.023529-73.286275l0-582.27451q0-77.301961 41.160784-111.937255t117.458824-34.635294l34.133333 0 68.266667 0 93.364706 0q51.2 0 104.909804-0.501961t104.909804-0.501961l94.368627 0 70.27451 0 35.137255 0q28.109804 0 49.192157 11.545098t35.137255 32.12549 21.584314 48.690196 7.529412 60.235294l0 406.588235q-191.74902 0-345.34902-1.003922l-128.501961 0q-64.25098 0-114.94902-0.501961t-83.827451-0.501961l-37.145098 0q-21.082353 0-41.160784 12.54902t-36.141176 34.133333-26.101961 50.196078-10.039216 59.733333q0 38.14902 10.541176 68.768627t27.607843 51.701961 37.647059 32.627451 40.658824 11.545098l685.678431 0q8.031373 0 14.556863 4.517647t6.52549 14.556863zM515.011765 0l0 388.517647 77.301961-108.423529 76.298039 108.423529 0-388.517647-153.6 0z"
              p-id="2520" fill="#f56c6c"></path>
          </svg>{{ bookInfo.bookName }}</div>
        <div class="book-author float"><svg t="1684561678490" class="icon" viewBox="0 0 1024 1024" version="1.1"
            xmlns="http://www.w3.org/2000/svg" p-id="6600">
            <path
              d="M21.19936 958.08l-12.352-12.288a30.208 30.208 0 0 1-7.296-30.912l171.008-516.032c9.344-28.352 28.864-52.16 54.784-66.944L462.22336 211.2a30.208 30.208 0 0 1 36.352 4.864l308.032 308.096c9.6 9.6 11.648 24.448 4.928 36.288l-120.448 235.2c-14.72 25.856-38.528 45.44-66.816 54.848l-515.072 171.904a30.208 30.208 0 0 1-30.976-7.296l-13.312-13.312 304.832-304.896a60.16 60.16 0 0 0 58.88-15.104 61.12 61.12 0 0 0-0.96-86.464 61.12 61.12 0 0 0-86.464-1.024 60.16 60.16 0 0 0-15.168 58.88L21.19936 958.08zM745.74336 19.648l257.472 257.408c26.24 26.24 26.24 68.736 0 94.976L901.13536 474.112a30.208 30.208 0 0 1-42.752 0L548.75136 164.48a30.208 30.208 0 0 1 0-42.752L650.83136 19.648a67.2 67.2 0 0 1 94.912 0z"
              fill="#f56c6c" p-id="6601"></path>
          </svg>{{ bookInfo.bookAuthor }}</div>
        <div class="chapter-count float"><svg t="1684562374857" class="icon" viewBox="0 0 1024 1024" version="1.1"
            xmlns="http://www.w3.org/2000/svg" p-id="30710">
            <path
              d="M640 85.3l200.8 200.8a42.7 42.7 0 0 1 12.5 30.2V896a42.7 42.7 0 0 1-42.7 42.7H213.3a42.7 42.7 0 0 1-42.7-42.7V128a42.7 42.7 0 0 1 42.7-42.7H640z m-85.3 256h-128v85.3h42.7v256h85.3V341.3z"
              p-id="30711" fill="#f56c6c"></path>
          </svg>{{ chapterInfo.chapterCount }}字</div>
      </div>
      <div class="chapter-content">
        <p v-for="(paragraph, paragraphId) in chapterInfo.paragraphs" :key="paragraphId">{{ paragraph }}</p>
      </div>
    </div>
    <div class="chapter-control">
      <a href="#">上一章</a>
      <span></span>
      <a href="#">回到目录</a>
      <span></span>
      <a href="#">下一章</a>
    </div>
  </div>
</template>
<script>
import 'css/reader/reader.css'
import { getBookDetiles, getBookCharpter } from "@/api/api";
import { nextTick } from 'vue';
export default {
  name: "ReaderComponent",
  data() {
    return {
      bookInfo: {
        bookId: 1,
        bookName: "斗破苍穹",
        bookAuthor: "天蚕土豆",
        chapterId: 1,
      },
      chapterInfo: {
        chapterTitle: "第一章 陨落的天才",
        chapterCount: "1500",
        paragraphs: ['斗之力，三段', '望着测验魔石碑上面闪亮得甚至有些刺眼的五个大字，少年面无表情，唇角有着一抹自嘲，紧握的手掌，因为大力，而导致略微尖锐的指甲深深的刺进了掌心之中，带来一阵阵钻心的疼痛', '萧炎，斗之力，三段级别：低级测验魔石碑之旁，一位中年男子，看了一眼碑上所显示出来的信息，语气漠然的将之公布了出来', '中年男子话刚刚脱口，便是不出意外的在人头汹涌的广场上带起了一阵嘲讽的骚动。', '三段嘿嘿，果然不出我所料，这个天才这一年又是在原地踏步', '哎，这废物真是把家族的脸都给丢光了。', '要不是族长是他的父亲，这种废物，早就被驱赶出家族，任其自生自灭了，哪还有机会待在家族中白吃白喝。', '唉，昔年那名闻乌坦城的天才少年，如今怎么落魄成这般模样了啊', '谁知道呢，或许做了什么亏心事，惹得神灵降怒了吧', '周围传来的不屑嘲笑以及惋惜轻叹，落在那如木桩待在原地的少年耳中，恍如一根根利刺狠狠的扎在心脏一般，让得少年呼吸微微急促。', '少年缓缓抬起头来，露出一张有些清秀的稚嫩脸庞，漆黑的眸子木然的在周围那些嘲讽的同龄人身上扫过，少年嘴角的自嘲，似乎变得更加苦涩了。', '这些人，都如此刻薄势力吗或许是因为三年前他们曾经在自己面前露出过最谦卑的笑容，所以，如今想要讨还回去吧苦涩的一笑，萧炎落寞的转身，安静的回到了队伍的最后一排，孤单的身影，与周围的世界，有些格格不入。', '下一个，萧媚', '听着测验人的喊声，一名少女快的人群中跑出，少女刚刚出场，附近的议论声便是小了许多，一双双略微火热的目光，牢牢的锁定着少女的脸颊', '少女年龄不过十四左右，虽然并算不上绝色，不过那张稚气未脱的小脸，却是蕴含着淡淡的妩媚，清纯与妩媚，矛盾的集合，让得她成功的成为了全场瞩目的焦点', '少女快步上前，小手轻车熟路的触摸着漆黑的魔石碑，然后缓缓闭上眼睛', '在少女闭眼片刻之后，漆黑的魔石碑之上再次亮起了光芒', '斗之气：七段', '萧媚，斗之气：七段级别:高级', '耶听着测验员所喊出的成绩，少女脸颊扬起了得意的笑容', '啧啧，七段斗之气，真了不起，按这进度，恐怕顶多只需要三年时间，她就能称为一名真正的斗者了吧', '不愧是家族中种子级别的人物啊', '听着人群中传来的一阵阵羡慕声，少女脸颊上的笑容更是多了几分，虚荣心，这是很多女孩都无法抗拒的诱惑', '与平日里的几个姐妹互相笑谈着，萧媚的视线，忽然的透过周围的人群，停在了人群外的那一道孤单身影上', '皱眉思虑了瞬间，萧媚还是打消了过去的念头，现在的两人，已经不在同一个阶层之上，以萧炎最近几年的表现，成年后，顶多只能作为家族中的下层人员，而天赋优秀的她，则将会成为家族重点培养的强者，前途可以说是不可限量。', '唉莫名的轻叹了一口气，萧媚脑中忽然浮现出三年前那意气风的少年，四岁练气，十岁拥有九段斗之气，十一岁突破十段斗之气，成功凝聚斗之气旋，一跃成为家族百年之内最年轻的斗者', '当初的少年，自信而且潜力无可估量，不知让得多少少女对其春心荡漾，当然，这也包括以前的萧媚。', '然而天才的道路，貌似总是曲折的，三年之前，这名声望达到巅峰的天才少年，却是突兀的接受到了有生以来最残酷的打击，不仅辛辛苦苦修炼十数载方才凝聚的斗之气旋，一夜之间，化为乌有，而且体内的斗之气，也是随着时间的流逝，变得诡异的越来越少。', '斗之气消失的直接结果，便是导致其实力不断的后退。', '从天才的神坛，一夜跌落到了连普通人都不如的地步，这种打击，让得少年从此失魂落魄，天才之名，也是逐渐的被不屑与嘲讽所替代。', '站的越高，摔得越狠，这次的跌落，或许就再也没有爬起的机会。', '下一个，萧薰儿', '喧闹的人群中，测试员的声音，再次响了起来。', '随着这有些清雅的名字响起，人群忽然的安静了下来，所有的视线，豁然转移。', '在众人视线汇聚之处，一位身着紫色衣裙的少女，正淡雅的站立，平静的稚嫩俏脸，并未因为众人的注目而改变分毫。', '少女清冷淡然的气质，犹如清莲初绽，小小年纪，却已初具脱俗气质，难以想象，日后若是长大，少女将会如何的倾国倾城', '这名紫裙少女，论起美貌与气质来，比先前的萧媚，无疑还要更胜上几分，也难怪在场的众人都是这般动作。', '莲步微移，名为萧薰儿的少女行到魔石碑之前，小手伸出，镶着黑金丝的紫袖滑落而下，露出一截雪白娇嫩的皓腕，然后轻触着石碑', '微微沉静，石碑之上，刺眼的光芒再次绽放。', '斗之气：九段级别：高级', '望着石碑之上的字体，场中陷入了一阵寂静。', '竟然到九段了，真是恐怖家族中年轻一辈的第一人，恐怕非薰儿小姐莫属了。寂静过后，周围的少年，都是不由自主的咽了一口唾沫，眼神充满敬畏', '斗之气，每位斗者的必经之路，初阶斗之气分一至十段，当体内斗之气到达十段之时，便能凝聚斗之气旋，成为一名受人尊重的斗者', '人群中，萧媚皱着浅眉盯着石碑前的紫裙少女，脸颊上闪过一抹嫉妒', '望着石碑上的信息，一旁的中年测验员漠然的脸庞上竟然也是罕见的露出了一丝笑意，对着少女略微恭声道：薰儿小姐，半年之后，你应该便能凝聚斗气之旋，如果你成功的话，那么以十四岁年龄成为一名真正的斗者，你是萧家百年内的第二人', '是的，第二人，那位第一人，便是褪去了天才光环的萧炎。', '谢谢。少女微微点了点头，平淡的小脸并未因为他的夸奖而出现喜悦，安静的回转过身，然后在众人炽热的注目中，缓缓的行到了人群最后面的那颓废少年面前', '萧炎哥哥。在经过少年身旁时，少女顿下了脚步，对着萧炎恭敬的弯了弯腰，美丽的俏脸上，居然露出了让周围少女为之嫉妒的清雅笑容。', '我现在还有资格让你怎么叫么望着面前这颗已经成长为家族中最璀璨的明珠，萧炎苦涩的道，她是在自己落魄后，极为少数还对自己依旧保持着尊敬的人。', '萧炎哥哥，以前你曾经与薰儿说过，要能放下，才能拿起，提放自如，是自在人萧薰儿微笑着柔声道，略微稚嫩的嗓音，却是暖人心肺。', '呵呵，自在人我也只会说而已，你看我现在的模样，象自在人吗而且这世界，本来就不属于我。萧炎自嘲的一笑，意兴阑珊的道。', '面对着萧炎的颓废，萧薰儿纤细的眉毛微微皱了皱，认真的道：萧炎哥哥，虽然并不知道你究竟是怎么回事，不过，薰儿相信，你会重新站起来，取回属于你的荣耀与尊严话到此处，微顿了顿，少女白皙的俏脸，头一次露出淡淡的绯红：当年的萧炎哥哥，的确很吸引人', '呵呵面对着少女毫不掩饰的坦率话语，少年尴尬的笑了一声，可却未再说什么，人不风流枉少年，可现在的他，实在没这资格与心情，落寞的回转过身，对着广场之外缓缓行去', '站在原地望着少年那恍如与世隔绝的孤独背影，萧薰儿踌躇了一会，然后在身后一干嫉妒的狼嚎声中，快步追了上去，与少年并肩而行'],
        marked: true,
      },
    }
  },
  components: {

  },
  methods: {
    markTheChapter() {

    },
    initChapter() {
      // console.log(0)
      // this.bookInfo.bookId =this.$route.params.bookid;
      this.bookInfo.chapterId =parseInt(this.$route.params.chapter);
      console.log([this.bookInfo.bookId,this.bookInfo.chapterId]);
      getBookDetiles(this.$route.params.bookid).then((data) => {
        this.bookInfo.bookName=data.title;
        this.bookInfo.bookId=data.id;
        this.bookInfo.bookAuthor =data.author;
        console.log(data);
        getBookCharpter(this.$route.params.bookid,this.$route.params.chapter).then((data2) => {
        this.chapterInfo.chapterTitle=data2.chaptertitle;//TODO
        // this.chapterInfo.paragraphs =[data.content];
        console.log(data2);
    });
    });

    }
  },
  created(){
    nextTick(this.initChapter()) ;
    // this.initChapter()
  }
}
</script>